Ryuzaki101/Embedded/DMC+DTMC/PIC/p18f452.h
#define _WDTPS_1_2H          0xF1
#define _WDTPS_128_2H        0xFF
#define _WDTPS_16_2H         0xF9
#define _WDTPS_2_2H          0xF3
#define _WDTPS_32_2H         0xFB
#define _WDTPS_4_2H          0xF5
#define _WDTPS_64_2H         0xFD
#define _WDTPS_8_2H          0xF7

/*-------------------------------------------------------------------------
 *   CONFIG3H (0x300005)
 *-------------------------------------------------------------------------*/
#define _CONFIG3H_DEFAULT    0x01
#define _CCP2MUX_OFF_3H      0xFE
#define _CCP2MUX_ON_3H       0xFF

/*-------------------------------------------------------------------------
 *   CONFIG4L (0x300006)
 *-------------------------------------------------------------------------*/
#define _CONFIG4L_DEFAULT    0x85
#define _STVR_OFF_4L         0xFE
#define _STVR_ON_4L          0xFF

#define _LVP_OFF_4L          0xFB
#define _LVP_ON_4L           0xFF

#define _DEBUG_OFF_4L        0xFF
#define _DEBUG_ON_4L         0x7F

/*-------------------------------------------------------------------------
 *   CONFIG5L (0x300008)
 *-------------------------------------------------------------------------*/
#define _CONFIG5L_DEFAULT    0x0F
#define _CP0_OFF_5L          0xFF
#define _CP0_ON_5L           0xFE

#define _CP1_OFF_5L          0xFF
#define _CP1_ON_5L           0xFD

#define _CP2_OFF_5L          0xFF
#define _CP2_ON_5L           0xFB

#define _CP3_OFF_5L          0xFF
#define _CP3_ON_5L           0xF7

/*-------------------------------------------------------------------------
 *   CONFIG5H (0x300009)
 *-------------------------------------------------------------------------*/
#define _CONFIG5H_DEFAULT    0xC0
#define _CPB_OFF_5H          0xFF
#define _CPB_ON_5H           0xBF

#define _CPD_OFF_5H          0xFF
#define _CPD_ON_5H           0x7F

/*-------------------------------------------------------------------------
 *   CONFIG6L (0x30000a)
 *-------------------------------------------------------------------------*/
#define _CONFIG6L_DEFAULT    0x0F
#define _WRT0_OFF_6L         0xFF
#define _WRT0_ON_6L          0xFE

#define _WRT1_OFF_6L         0xFF
#define _WRT1_ON_6L          0xFD

#define _WRT2_OFF_6L         0xFF
#define _WRT2_ON_6L          0xFB

#define _WRT3_OFF_6L         0xFF
#define _WRT3_ON_6L          0xF7

/*-------------------------------------------------------------------------
 *   CONFIG6H (0x30000b)
 *-------------------------------------------------------------------------*/
#define _CONFIG6H_DEFAULT    0xE0
#define _WPC_OFF_6H          0xFF
#define _WPC_ON_6H           0xDF

#define _WPB_OFF_6H          0xFF
#define _WPB_ON_6H           0xBF

#define _WPD_OFF_6H          0xFF
#define _WPD_ON_6H           0x7F

/*-------------------------------------------------------------------------
 *   CONFIG7L (0x30000c)
 *-------------------------------------------------------------------------*/
#define _CONFIG7L_DEFAULT    0x0F
#define _EBTR0_OFF_7L        0xFF
#define _EBTR0_ON_7L         0xFE

#define _EBTR1_OFF_7L        0xFF
#define _EBTR1_ON_7L         0xFD

#define _EBTR2_OFF_7L        0xFF
#define _EBTR2_ON_7L         0xFB

#define _EBTR3_OFF_7L        0xFF
#define _EBTR3_ON_7L         0xF7

/*-------------------------------------------------------------------------
 *   CONFIG7H (0x30000d)
 *-------------------------------------------------------------------------*/
#define _CONFIG7H_DEFAULT    0x40
#define _EBTRB_OFF_7H        0xFF
#define _EBTRB_ON_7H         0xBF


#endif
